pipeSteadyFixdFlux_v12/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    pipeEntry
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 1000; // W/m^2
        value           $internalField;
    }
    pipeFullyDev
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 1000; // W/m^2  
        value           $internalField;
    }
}


// ************************************************************************* //
