pipeSteadyFixdFlux_v12/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;
    limited             Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          bounded Gauss linearUpwind limited;
    div(phi,e)          bounded Gauss linearUpwind limited;
    div(phi,(p|rho))    bounded Gauss linearUpwind limited;
    div(phi,K)          bounded Gauss linearUpwind limited;
    turbulence          bounded Gauss linearUpwind limited;
    div(phi,epsilon)    $turbulence;
    div(phi,k)          $turbulence;
    div(phi,omega)      $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U)))))      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
